; domain
(define (domain depot)
(:requirements :typing :fluents)
(:types place locatable - object
  depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions
  (load_limit ?t - truck)
  (current_load ?t - truck)
  (weight ?c - crate)
  (fuel-cost)
)

(:action drive
:parameters (?x - truck ?y - place ?z - place)
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
    (increase (fuel-cost) 10)))

(:action lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x))
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action drop
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
    (on ?y ?z)))

(:action load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
    (<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
    (increase (current_load ?z) (weight ?y))))

(:action unload
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
    (decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob5656) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 distributor0)
	(clear crate4)
	(at pallet2 distributor1)
	(clear crate2)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 295)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 268)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 89)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 62)
	(at crate2 distributor1)
	(on crate2 crate0)
	(= (weight crate2) 42)
	(at crate3 distributor0)
	(on crate3 pallet1)
	(= (weight crate3) 37)
	(at crate4 distributor0)
	(on crate4 crate3)
	(= (weight crate4) 11)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet1)
		(on crate2 pallet0)
		(on crate3 crate4)
		(on crate4 pallet2)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 4
2. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 62
   goals met: 0 of 4
3. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 4
4. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 42
   goals met: 0 of 4
5. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 4
6. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 42 to 131
   goals met: 0 of 4
7. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 4
8. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 4
9. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 23 to 33
   goals met: 0 of 4
10. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 131 to 89
   goals met: 0 of 4
11. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 33 to 43
   goals met: 0 of 4
12. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 1 of 4
13. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 43 to 53
   goals met: 1 of 4
14. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 62 to 0
   goals met: 1 of 4
15. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 53 to 63
   goals met: 1 of 4
16. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 63 to 73
   goals met: 1 of 4
17. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 89 to 151
   goals met: 1 of 4
18. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 73 to 83
   goals met: 1 of 4
19. (drive truck1 distributor1 distributor1)
   changed: (fuel-cost) from 83 to 93
   goals met: 1 of 4
20. (lift hoist1 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   changed: (fuel-cost) from 93 to 94
   goals met: 1 of 4
21. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 151 to 162
   goals met: 1 of 4
22. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   changed: (fuel-cost) from 94 to 95
   goals met: 1 of 4
23. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 162 to 199
   goals met: 1 of 4
24. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 95 to 105
   goals met: 1 of 4
25. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 199 to 188
   goals met: 1 of 4
26. (drop hoist2 crate4 pallet2 distributor1)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 pallet2)
   goals met: 2 of 4
27. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 188 to 151
   goals met: 2 of 4
28. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 105 to 115
   goals met: 2 of 4
29. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 151 to 62
   goals met: 2 of 4
30. (drop hoist1 crate0 pallet1 distributor0)
   deleted: (lifting hoist1 crate0) (clear pallet1)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 pallet1)
   goals met: 3 of 4
31. (drop hoist2 crate3 crate4 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate4)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate4)
   goals met: 4 of 4
